import Service1Src from "../assets/image/services/1.jpg";
import Service2Src from "../assets/image/services/2.jpg";
import Service3Src from "../assets/image/services/3.jpg";
import Service1SrcSmall from "../assets/image/services/300x250/1.png";
import Service2SrcSmall from "../assets/image/services/300x250/2.png";
import Service3SrcSmall from "../assets/image/services/300x250/3.png";

const menuItems = [
  { title: "ჩვენს შესახებ", path: "/about" },
  { title: "ფასები", path: "/prices" },
  { title: "გალერეა", path: "/gallery" },
  { title: "კონტაქტი", path: "/contact" },
];

export { menuItems };

const services: Service[] = [
  {
    title: "დეტალური წმენდა",
    src: Service1Src,
    srcSmall: Service1SrcSmall,
    description: [
      "ავტომობილის სიღრმისეული გარე და შიგა წმენდა, რაც მას ახალ სახეს ანიჭებს.",
      "ჩვენ ვიყენებთ სპეციალურად შერჩეულ ქიმიურ საშუალებებს, რომლებიც უსაფრთხოდ და ეფექტურად წმენდება, არ აზიანებს მასალებს.",
      "ტორპედოს, საბარგულისა და სავარძლების სისუფთავე.",
      "მაღალი ხარისხის აპარატურა.",
    ],
    prices: [
      {
        car: "სედანი",
        price: 150,
      },
      {
        car: "ჯიპი",
        price: 180,
      },
    ],
  },
  {
    title: "დიაგნოსტიკა",
    src: Service2Src,
    srcSmall: Service2SrcSmall,
    description: [
      "დიაგნოსტიკა, რომელიც მოგაწვდით ინფორმაციას თქვენი ავტომობილის ზოგადი მდგომარეობის შესახებ.",
      "ძირითადი სისტემების, როგორიცაა ძრავი, ტრანსმისია და უსაფრთხოების სისტემების შემოწმება.",
      "ჩვენ ვიყენებთ ახალ ტექნოლოგიებს, რათა ზუსტად და სწრაფად გამოვავლინოთ ნებისმიერი პრობლემა.",
      "დაწვრილებითი ანგარიში და გაფრთხილებები შესაძლო პრობლემებზე.",
    ],
    prices: [
      {
        car: "სედანი",
        price: 100,
      },
      {
        car: "ჯიპი",
        price: 120,
      },
    ],
  },
  {
    title: "ჭერის გადაკვრა და აღდგენა",
    src: Service3Src,
    srcSmall: Service3SrcSmall,
    description: [
      "დაზიანებული ჭერის აღდგენა — რომ თქვენი ავტომობილის ინტერიერი იყოს კვლავ როგორც ახალი.",
      "მაღალი ხარისხის ნაჭრის ან ტყავის გამოყენებით.",
      "აირბაგების, დაზიანების შემთხვევაში, აღდგენა.",
    ],
    prices: [
      {
        car: "სედანი",
        price: 200,
      },
      {
        car: "ჯიპი",
        price: 230,
      },
    ],
  },
];

export { services };

const aboutCompany = [
  "Car Revamp არის ავტომობილების სერვისის კომპანია, რომელიც სპეციალიზირდება ავტომობილის შიდა და გარე მდგომარეობის გაუმჯობესებაზე. ჩვენი მიზანია, რომ თქვენს მანქანას დავუბრუნოთ პირვანდელი სილამაზე.",

  "ჩვენ გთავაზობთ სრულ სერვისებს, რომლებიც მოიცავს ავტომობილის დეტალურ წმენდას, ჭერის აღდგენას, დიაგნოსტიკას და ბევრ სხვა მომსახურებას. Car Revamp არის ადგილი, სადაც შეგიძლიათ დაეყრდნოთ მაღალი ხარისხის მომსახურებას და ზრუნვას თქვენი ავტომობილისთვის.",

  "ჩვენ ვიყენებთ მხოლოდ მაღალი ხარისხის, გამოცდილი მასალებისა და აპარატურის გამოყენებას, რაც უზრუნველყოფს ჩვენს მომსახურების უმაღლეს სტანდარტებს. ყოველ სამუშაოს გავდივართ ზედმიწევნით და ვიღებთ ყველა დეტალს, რომ თქვენს ავტომობილს მივცეთ ახალი სიცოცხლე.",

  "თუ თქვენ გსურთ, რომ თქვენი ავტომობილი გამოიყურებოდეს ისე, თითქოს ახლახანს იყიდეთ, მაშინ Car Revamp არის საუკეთესო არჩევანი. ჩვენთან მუშაობა ნიშნავს თქვენი მანქანისთვის საუკეთესო ზრუნვას.",
];

export { aboutCompany };
